tap "homebrew/bundle"
tap "homebrew/core"
# Search tool like grep, but optimized for programmers
brew "ack"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Distributed revision control system
brew "git"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Powerful interactive system for text processing
brew "xml-coreutils"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
